use librarymanagement;
	
INSERT INTO authors VALUES 
(1, "Джоан Ролінг"),
(2, "Антуан де Сент-Екзюпері"),
(3, "Жюль Верн"),
(4, "Пауло Коельйо"),
(5, "Агата Крісті");

INSERT INTO genres VALUES 
(101, "дитяча література"),
(102, "пригоди"),
(103, "фентезі"),
(104, "детектив");

INSERT INTO books VALUES 
(1, "Гаррі Поттер і філософський камень", 1997, 1, 101),
(2, "Маленький принц", 1943, 2, 101),
(3, "Таємничий острів", 1974, 3, 102),
(4, "Алхімік", 1988, 4, 103),
(5, "Убивство Східному експресі", 1934, 5, 104);

INSERT INTO users VALUES
(1, "Мельниченко", "melnychenko@gmail.com"),
(2, "Коваленко", "kovalenko@gmail.com"),
(3, "Шевченко", "shevchenko@gmail.com");

INSERT INTO borrowed_books VALUES
(1, 1, 3, '2024-10-10', '2024-11-30'),
(2, 2, 1, '2023-11-05', '2023-12-23'),
(3, 4, 2, '2022-04-17', '2025-05-20'),
(4, 5, 3, '2024-01-01', '2024-05-15'),
(5, 3, 1, '2025-03-08', '2025-06-08');
